sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : hidkbdservice.c
 * Author             : WCH
 * Version            : V1.0
 * Date               : 2018/12/10
 * Description        : 键盘服务
 *********************************************************************************
 * Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for 
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/

/*********************************************************************
 * INCLUDES
 */
#include "CONFIG.h"
#include "hidkbdservice.h"
#include "hiddev.h"
#include "battservice.h"
#include "CH585SFR.h"
/*********************************************************************
 * MACROS
 */
#define USE_SYS_CTR_HID 1
/*********************************************************************
 * CONSTANTS
 */

/*********************************************************************
 * TYPEDEFS
 */

/*********************************************************************
 * GLOBAL VARIABLES
 */
// HID service UUID
const uint8_t hidServUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(HID_SERV_UUID), HI_UINT16(HID_SERV_UUID)};

// HID Boot Keyboard Input Report characteristic
const uint8_t hidBootKeyInputUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(BOOT_KEY_INPUT_UUID), HI_UINT16(BOOT_KEY_INPUT_UUID)};

// HID Boot Keyboard Output Report characteristic
const uint8_t hidBootKeyOutputUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(BOOT_KEY_OUTPUT_UUID), HI_UINT16(BOOT_KEY_OUTPUT_UUID)};

// HID Information characteristic
const uint8_t hidInfoUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(HID_INFORMATION_UUID), HI_UINT16(HID_INFORMATION_UUID)};

// HID Report Map characteristic
const uint8_t hidReportMapUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(REPORT_MAP_UUID), HI_UINT16(REPORT_MAP_UUID)};

// HID Control Point characteristic
const uint8_t hidControlPointUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(HID_CTRL_PT_UUID), HI_UINT16(HID_CTRL_PT_UUID)};

// HID Report characteristic，所有报告，键盘，鼠标，触摸板都使用这个
const uint8_t hidReportUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(REPORT_UUID), HI_UINT16(REPORT_UUID)};

// HID Protocol Mode characteristic
const uint8_t hidProtocolModeUUID[ATT_BT_UUID_SIZE] = {
    LO_UINT16(PROTOCOL_MODE_UUID), HI_UINT16(PROTOCOL_MODE_UUID)};

/*********************************************************************
 * EXTERNAL VARIABLES
 */

/*********************************************************************
 * EXTERNAL FUNCTIONS
 */

/*********************************************************************
 * LOCAL VARIABLES
 */

// HID Information characteristic value
static const uint8_t hidInfo[HID_INFORMATION_LEN] = {
    LO_UINT16(0x0111), HI_UINT16(0x0111), // bcdHID (USB HID version)
    0x00,                                 // bCountryCode
    HID_FEATURE_FLAGS                     // Flags
};
#define APPLE   0
//#define ENABLE_MAC_FN_REPORT   1
#define MOUSE   0
//#define SMART_WHEEL   1
#define TOUCH    1

/************************** IOS begin *********************************/
// 物理尺寸.3*100.4mm
// x y 轴物理最大值
#define IOS_HID_TOUCHPAD_MAX_PHYSICAL_X  1016//1610//1173 // 显示值  设备代表值的边界
#define IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y  555//822//600 
// 逻辑最大值
#define IOS_HID_TOUCHPAD_MAX_LOGICAL_X 	(1728-1)//2729//1990//0x578  // 实际值 1293   测量值 读数 设备返回数值的边界
#define IOS_HID_TOUCHPAD_MAX_LOGICAL_Y  (944-1)//1394//1017//0x320  // 800

#define FINGER_IOS(FINGER_NUMBER) \
	0x05, 0x0D , /*  USAGE PAGE (Digitizer Device Page)  */ \
	0x09, 0x22 , /*  USAGE (Finger)  */ \
	0xA1, 0x00 , /*  COLLECTION (PHYSICAL)  */ \
		0x25, 0x01 , /*  LOGICAL MAXIMUM (1)  */ \
		0x09, 0x42 , /*  USAGE (Tip Switch)  */ \
		0x09, 0x47 , /*  USAGE (Confidence)  */ \
		0x75, 0x01 , /*  REPORT SIZE (1)  */ \
		0x95, 0x02 , /*  REPORT COUNT (2)  */ \
		0x81, 0x02 , /*  INPUT (Data,Var,Abs)  */ \
		0x09, 0x38 , /*  USAGE (Transducer Index)  */ \
		0x25, 0x05 , /*  LOGICAL MAXIMUM (5)  */ \
		0x75, 0x06 , /*  REPORT SIZE (6)  */ \
		0x95, 0x01 , /*  REPORT COUNT (1)  */ \
		0x81, 0x02 , /*  INPUT (Data,Var,Abs)  */ \
		0x05, 0x01 , /*  USAGE PAGE (Generic Desktop Page)  */ \
		0x35, 0x00,/* PHYSICAL_MINIMUM (0) */ \
		0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_X & 0xff, \
			IOS_HID_TOUCHPAD_MAX_PHYSICAL_X >> 8, /*  PHYSICAL MAXIMUM (921)  */ \
		0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_X & 0xff, \
			IOS_HID_TOUCHPAD_MAX_LOGICAL_X >> 8, /*  LOGICAL MAXIMUM (1105)  */ \
		0x15, 0x00,/* LOGICAL_MINIMUM (0)*/ \
		0x75, 0x0c, /*  REPORT SIZE (12)  */ \
		0x55, 0x0e,/* UNIT_EXPONENT (-2) */ \
		0x65, 0x11,/* UNIT(SI Length (cm)) 单位*/ \
		0x09, 0x30 , /*  USAGE (X)  */ \
		0x81, 0x02 , /*  INPUT (Data,Var,Abs)  */ \
		0x35, 0x00,/* PHYSICAL_MINIMUM (0) */ \
		0x46, IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y & 0xff, \
			IOS_HID_TOUCHPAD_MAX_PHYSICAL_Y >> 8, /*  PHYSICAL MAXIMUM (506)  */ \
		0x15, 0x00,/* LOGICAL_MINIMUM (0)*/ \
		0x26, IOS_HID_TOUCHPAD_MAX_LOGICAL_Y & 0xff, \
			IOS_HID_TOUCHPAD_MAX_LOGICAL_Y >> 8, /*  LOGICAL MAXIMUM (607)  */ \
		0x09, 0x31 , /*  USAGE (Y)  */ \
		0x81, 0x02 , /*  INPUT (Data,Var,Abs)  */ \
		0x45, 0x00, /* Physical Maximum: 0 */ \
		0x55, 0x00, /* Unit exponent: 0 */ \
		0x65, 0x00, /* Unit: None */ \
	0xC0,  /*  END COLLECTION (Physical)  */

// HID Report Map characteristic value
static const uint8_t hidReportMap[] = {

        0x05, 0x01,     // Usage Pg (Generic Desktop)
        0x09, 0x06,     // Usage (Keyboard)
        0xA1, 0x01,     // Collection: (Application)
        0x85, HID_RPT_ID_CLASS_KEY_IN,     //   ReportID(1)
                        //
        0x05, 0x07,     // Usage Pg (Key Codes)
        0x19, 0xE0,     // Usage Min (224)
        0x29, 0xE7,     // Usage Max (231)
        0x15, 0x00,     // Log Min (0)
        0x25, 0x01,     // Log Max (1)
                        //
                        // Modifier byte
        0x75, 0x01,     // Report Size (1)
        0x95, 0x08,     // Report Count (8)
        0x81, 0x02,     // Input: (Data, Variable, Absolute)
                        //
                        // Reserved byte
        0x95, 0x01,     // Report Count (1)
        0x75, 0x08,     // Report Size (8)
        0x81, 0x01,     // Input: (Constant)
                        //
                        // LED report
        0x95, 0x05,     // Report Count (5)
        0x75, 0x01,     // Report Size (1)
        0x05, 0x08,     // Usage Pg (LEDs)
        0x19, 0x01,     // Usage Min (1)
        0x29, 0x05,     // Usage Max (5)
        0x91, 0x02,     // Output: (Data, Variable, Absolute)
                        //
                        // LED report padding
        0x95, 0x01,     // Report Count (1)
        0x75, 0x03,     // Report Size (3)
        0x91, 0x01,     // Output: (Constant)
                        //
                        // Key arrays (6 bytes)
        0x95, 0x06,     // Report Count (6)
        0x75, 0x08,     // Report Size (8)
        0x15, 0x00,     // Log Min (0)
        0x25, 0x65,     // Log Max (101)
        0x05, 0x07,     // Usage Pg (Key Codes)
        0x19, 0x00,     // Usage Min (0)
        0x29, 0x65,     // Usage Max (101)
        0x81, 0x00,     // Input: (Data, Array)
                        //
        0xC0 ,           // End Collection
#if USE_SYS_CTR_HID
    0x05,0x01,                  //25    GLOBAL_USAGE_PAGE(Generic Desktop Controls)
    0x09,0x80,                  //27    LOCAL_USAGE(SYS_CTL)
    0xA1,0x01,                  //29    MAIN_COLLECTION(Applicatior)
        0x85,HID_RPT_ID_SYS_CTL_IN,                  //31    GLOBAL_REPORT_ID(2)
        0x05,0x01,                  //33    GLOBAL_USAGE_PAGE(Generic Desktop Controls)
        0x19,0x81,                  //35    LOCAL_USAGE_MINIMUM(129)
        0x29,0x83,                  //37    LOCAL_USAGE_MAXIMUM(131)
        0x15,0x00,                  //39    GLOBAL_LOGICAL_MINIMUM(0)
        0x25,0x01,                  //41    GLOBAL_LOCAL_MAXIMUM(1)
        0x95,0x03,                  //43    GLOBAL_REPORT_COUNT(3)
        0x75,0x01,                  //45    GLOBAL_REPORT_SIZE(1)
        0x81,0x02,                  //47    MAIN_INPUT(data var absolute NoWrap linear PreferredState NoNullPosition NonVolatile )  Input 2.3
        0x95,0x01,                  //49    GLOBAL_REPORT_COUNT(1)
        0x75,0x05,                  //51    GLOBAL_REPORT_SIZE(5)
        0x81,0x01,                  //53    MAIN_INPUT(const array absolute NoWrap linear PreferredState NoNullPosition NonVolatile )   Input 3.0
    0xC0,                       //55    MAIN_COLLECTION_END

//    //system control
//    0x05, 0x01,
//    0x09, 0x80,
//    0xA1, 0x01,
//    0x85, HID_RPT_ID_SYS_CTL_IN,  //report ID (2)
//    0x75, 0x02,
//    0x95, 0x01,
//    0x15, 0x01,
//    0x25, 0x03,
//    0x09, 0x82, //count 3
//    0x09, 0x81,
//    0x09, 0x83,
//    0x81, 0x60,
//    0x75, 0x06,
//    0x81, 0x03,
//    0xc0,

//    0x05, 0x01,        // Usage Page (Generic Desktop Ctrls)
//    0x09, 0x80,        // Usage (Sys Control)
//    0xA1, 0x01,        // Collection (Application)
//    0x85, HID_RPT_ID_SYS_CTL_IN,        //   Report ID (2)
//    0x75, 0x01,        //   Report Size (1)
//    0x95, 0x08,        //   Report Count (8)
//    0x15, 0x00,        //   Logical Minimum (0)
//    0x25, 0x01,        //   Logical Maximum (1)
//    0x09, 0x81,        //   Usage (Sys Power Down)
//    0x09, 0x82,        //   Usage (Sys Sleep)
//    0x09, 0x83,        //   Usage (Sys Wake Up)
//    0x81, 0x06,        //   Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
//    0xC0,              // End Collection
#if TOUCH
    0x05, 0x0D , // USAGE PAGE (Digitizer Device Page)
    0x09, 0x05 , // USAGE (Touch Pad)
    0xA1, 0x01 , // COLLECTION (Application)
    0x85, 0x03, //  REPORT_ID (2) 先使用鼠标一样的

    FINGER_IOS(0)  FINGER_IOS(1) FINGER_IOS(2) FINGER_IOS(3)

    0x05, 0x0D,        //   Usage Page (Digitizer)
	// 0x55, 0x0C,        //   Unit Exponent (-4)
	// 0x66, 0x01, 0x10,  //   Unit (System: SI Linear, Time: Seconds)
	// 0x47, 0xFF, 0xFF, 0x00, 0x00,  //   Physical Maximum (65534)
	0x27, 0xFF, 0xFF, 0x00, 0x00,  //   Logical Maximum (65534)
	0x75, 0x10,        //   Report Size (16)
	0x95, 0x01,        //   Report Count (1)
	0x09, 0x56,        //   Usage (0x56)
	0x81, 0x02,        //   Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x09 , //  USAGE PAGE (Button Page)
    0x25, 0x01 , //  LOGICAL MAXIMUM (1)
    0x19, 0x01 , //  USAGE MINIMUM (Button 1)
    0x29, 0x02 , //  USAGE MAXIMUM (Button 2)
    0x95, 0x02 , //  REPORT COUNT (2)
    0x75, 0x01 , //  REPORT SIZE (1)
    0x81, 0x02 , //  INPUT (Data,Var,Abs)
    0x95, 0x06 , //  REPORT COUNT (6)
    0x81, 0x01 , //  INPUT (Cost, Ary, Abs)
    0xC0,  // END COLLECTION (Application)

    0x05, 0x0D , // USAGE PAGE (Digitizer Device Page)
    0x09, 0x05 , // USAGE (Touch Pad)
    0xA1, 0x01 , // COLLECTION (Application)
    0x85, 0x07, //  REPORT_ID (8) 待定 先使用不重复的
    0x25, 0x01 , //  LOGICAL MAXIMUM (1)
    0x75, 0x01 , //  REPORT SIZE (1)
    0x95, 0x01,  //REPORT COUNT (1)
    0x09, 0x57 , //  USAGE (Surface Switch)
    0xB1, 0x02 , //  FEATURE (Data,Var,Abs)
    0x26, 0xFF ,0x7F , //  LOGICAL MAXIMUM (32767)
    0x75, 0x0F , //  REPORT SIZE (15)
    0x95, 0x01,  //REPORT COUNT (1)
    0x09, 0xA1 , //  USAGE (Report Rate)
    0xB1, 0x02 , //  FEATURE (Data,Var,Abs)
    0xC0,  // END COLLECTION (Application)
#endif
#if MOUSE
    0x05, 0x01,        // Usage Page (Generic Desktop Ctrls)
    0x09, 0x02,        // Usage (Mouse)
    0xA1, 0x01,        // Collection (Application)
    0x85,HID_RPT_ID_MOUSE_IN,                  //6     GLOBAL_REPORT_ID(3)
    0x09, 0x01,        //   Usage (Pointer)
    0xA1, 0x00,        //   Collection (Physical)
    0x05, 0x09,        //     Usage Page (Button)
    0x19, 0x01,        //     Usage Minimum (0x01)
    0x29, 0x03,        //     Usage Maximum (0x03)
    0x15, 0x00,        //     Logical Minimum (0)
    0x25, 0x01,        //     Logical Maximum (1)
    0x75, 0x01,        //     Report Size (1)
    0x95, 0x03,        //     Report Count (3)
    0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x75, 0x05,        //     Report Size (5)
    0x95, 0x01,        //     Report Count (1)
    0x81, 0x01,        //     Input (Const,Array,Abs,No Wrap,Linear,Preferred State,No Null Position)
    0x05, 0x01,        //     Usage Page (Generic Desktop Ctrls)
    0x09, 0x30,        //     Usage (X)
    0x09, 0x31,        //     Usage (Y)
    0x09, 0x38,        //     Usage (Wheel)
    0x15, 0x81,        //     Logical Minimum (-127)
    0x25, 0x7F,        //     Logical Maximum (127)
    0x75, 0x08,        //     Report Size (8)
    0x95, 0x03,        //     Report Count (3)
    0x81, 0x06,        //     Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
    0xC0,              //   End Collection
    0xC0,              // End Collection

//        0x05,0x01,                  //81    GLOBAL_USAGE_PAGE(Generic Desktop Controls)
//        0x09,0x02,                  //83    LOCAL_USAGE(Mouse)
//        0xA1,0x01,                  //85    MAIN_COLLECTION(Applicatior)
//        0x09,0x01,                  //89    LOCAL_USAGE(Pointer)
//        0xA1,0x00,                  //91    MAIN_COLLECTION(Physical)
//        0x85,HID_RPT_ID_MOUSE_IN,                  //6     GLOBAL_REPORT_ID(3)
//        0x05,0x09,                  //93    GLOBAL_USAGE_PAGE(Button)
//        0x19,0x01,                  //95    LOCAL_USAGE_MINIMUM(1)
//        0x29,0x05,                  //97    LOCAL_USAGE_MAXIMUM(5)
//        0x15,0x00,                  //99    GLOBAL_LOGICAL_MINIMUM(0)
//        0x25,0x01,                  //101   GLOBAL_LOCAL_MAXIMUM(1)
//        0x95,0x05,                  //103   GLOBAL_REPORT_COUNT(5)
//        0x75,0x01,                  //105   GLOBAL_REPORT_SIZE(1)
//        0x81,0x02,                  //107   MAIN_INPUT(data var absolute NoWrap linear PreferredState NoNullPosition NonVolatile )  Input 18.5
//        0x95,0x01,                  //109   GLOBAL_REPORT_COUNT(1)
//        0x75,0x03,                  //111   GLOBAL_REPORT_SIZE(3)
//        0x81,0x01,                  //113   MAIN_INPUT(const array absolute NoWrap linear PreferredState NoNullPosition NonVolatile )   Input 19.0
//        0x05,0x01,                  //115   GLOBAL_USAGE_PAGE(Generic Desktop Controls)
//        0x09,0x30,                  //117   LOCAL_USAGE(X)
//        0x09,0x31,                  //119   LOCAL_USAGE(Y)
//        0x16, 0x00, 0x80,  //     Logical Minimum (-32768)
//        0x26, 0xFF, 0x7F,  //     Logical Maximum (32767)
//        0x75,0x10,                  //127   GLOBAL_REPORT_SIZE(16)
//        0x95,0x02,                  //129   GLOBAL_REPORT_COUNT(2)
//        0x81, 0x06,        //     Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
//        0x09,0x38,                  //121   LOCAL_USAGE(Wheel)
//        0x15,0x81,                  //123   GLOBAL_LOGICAL_MINIMUM(-127)
//        0x25,0x7F,                  //125   GLOBAL_LOCAL_MAXIMUM(127)
//        0x75,0x08,                  //127   GLOBAL_REPORT_SIZE(8)
//        0x95,0x01,                  //129   GLOBAL_REPORT_COUNT(1)
//        0x81,0x06,                  //131   MAIN_INPUT(data var relative NoWrap linear PreferredState NoNullPosition NonVolatile )  Input 22.0
//        0x95, 0x01,        //     Report Count (1)
//        0x05, 0x0C,        //     Usage Page (Consumer)
//        0x0A, 0x38, 0x02,  //     Usage (AC Pan)
//        0x81, 0x06,        //     Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
//        0xC0,                       //133   MAIN_COLLECTION_END
//        0xC0,                       //134   MAIN_COLLECTION_END


#endif

