sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
    0x05,0x0C,                  //0     GLOBAL_USAGE_PAGE(Consumer)
    0x09,0x01,                  //2     LOCAL_USAGE(    Consumer Control    )
    0xA1,0x01,                  //4     MAIN_COLLECTION(Applicatior)
        0x85,HID_RPT_ID_CONSUMER_IN,                  //6     GLOBAL_REPORT_ID(3)
        0x19,0x00,                  //8     LOCAL_USAGE_MINIMUM(0)
        0x2A,0x3C,0x03,             //10    LOCAL_USAGE_MAXIMUM(828)
        0x15,0x00,                  //13    GLOBAL_LOGICAL_MINIMUM(0)
        0x26,0x3C,0x03,             //15    GLOBAL_LOCAL_MAXIMUM(828)
        0x95,0x01,                  //18    GLOBAL_REPORT_COUNT(1)
        0x75,0x10,                  //20    GLOBAL_REPORT_SIZE(16)
        0x81,0x00,                  //22    MAIN_INPUT(data array absolute NoWrap linear PreferredState NoNullPosition NonVolatile )    Input 2.0
    0xC0,                       //24    MAIN_COLLECTION_END

    0x05,0x01,                  //0     GLOBAL_USAGE_PAGE(Generic Desktop Controls)
    0x09,0x06,                  //2     LOCAL_USAGE(Keyboard)
    0xA1,0x01,                  //4     MAIN_COLLECTION(Applicatior)
    0x85,HID_RPT_ID_ALL_KEY_IN,                  //6     GLOBAL_REPORT_ID(2)
    0x05,0x07,                  //8     GLOBAL_USAGE_PAGE(Keyboard/Keypad)
    0x19,0x04,                  //10    LOCAL_USAGE_MINIMUM(4)
    0x29,0x70,                  //12    LOCAL_USAGE_MAXIMUM(112)
    0x15,0x00,                  //14    GLOBAL_LOGICAL_MINIMUM(0)
    0x25,0x01,                  //16    GLOBAL_LOCAL_MAXIMUM(1)
    0x75,0x01,                  //18    GLOBAL_REPORT_SIZE(1)
    0x95,0x78,                  //20    GLOBAL_REPORT_COUNT(120)
    0x81,0x02,                  //22    MAIN_INPUT(data var absolute NoWrap linear PreferredState NoNullPosition NonVolatile )  Input 15.0
    0xC0,                       //24    MAIN_COLLECTION_END

#ifdef  ENABLE_MAC_FN_REPORT
     0x05, 0x0c,   //# Usage Page (Consumer Devices)
     0x09, 0x01,   //#   Usage (Consumer Control)
     0xa1, 0x01,   //#   Collection (Application)
     0x85, HID_RPT_ID_FN_IN, //  ###~~~~~~~~~~~~~  #   Report ID=0x11
     0x15, 0x00,   //#LOGICAL_MINIMUM(0)
     0x25, 0x01,   //#LOGICAL_MAXIMUM(1)
     0x75, 0x01,   //# REPORT_SIZE(1)
     0x95, 0x03,   //#REPORT_COUNT(3)
     0x81, 0x01,   //#INPUT(Const,Ary,Abs)-------------3bit
     0x75, 0x01,   //#REPORT_SIZE(1)
     0x95, 0x01,   //#REPORT_COUNT(1)
     0x05, 0x0c,   //#USAGE_PAGE(Consumer Devices)
     0x09, 0xb8,   //#USAGE(Eject)
     0x81, 0x02,   //#INPUT(Data,Var,Abs)----------------1bit
     0x06, 0xff, 0x00,   //#USAGE_PAGE(Reserved)
     0x09, 0x03,   //#USAGE(Fn)
     0x81, 0x02,   //#INPUT(Data,Var,Abs)----------------1bit
     0x75, 0x01,   //#REPORT_SIZE(1)
     0x95, 0x03,   //#REPORT_COUNT(3)
     0x81, 0x01,   //#INPUT(Const,Ary,Abs)----------------3bit
     0xc0,
#endif
#ifdef  SMART_WHEEL
     // smart wheel
     0x05, 0x01,        // Usage Page (Generic Desktop Ctrls)
     0x09, 0x0E,        // Usage (0x0E)
     0xA1, 0x01,        // Collection (Application)
     0x85, HID_RPT_ID_SMART_WHEEL_IN,        //   Report ID (8)
     0x05, 0x0D,        //   Usage Page (Digitizer)
     0x09, 0x21,        //   Usage (Puck)
     0xA1, 0x00,        //   Collection (Physical)
     0x05, 0x09,        //     Usage Page (Button)
     0x09, 0x01,        //     Usage (0x01)
     0x95, 0x01,        //     Report Count (1)
     0x75, 0x01,        //     Report Size (1)
     0x15, 0x00,        //     Logical Minimum (0)
     0x25, 0x01,        //     Logical Maximum (1)
     0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
     0x05, 0x01,        //     Usage Page (Generic Desktop Ctrls)
     0x09, 0x37,        //     Usage (Dial)
     0x95, 0x01,        //     Report Count (1)
     0x75, 0x0F,        //     Report Size (15)
     0x55, 0x0F,        //     Unit Exponent (-1)
     0x65, 0x14,        //     Unit (System: English Rotation, Length: Centimeter)
     0x36, 0xF0, 0xF1,  //     Physical Minimum (-3600)
     0x46, 0x10, 0x0E,  //     Physical Maximum (3600)
     0x16, 0xF0, 0xF1,  //     Logical Minimum (-3600)
     0x26, 0x10, 0x0E,  //     Logical Maximum (3600)
     0x81, 0x06,        //     Input (Data,Var,Rel,No Wrap,Linear,Preferred State,No Null Position)
     0x09, 0x30,        //     Usage (X)
     0x75, 0x10,        //     Report Size (16)
     0x55, 0x0D,        //     Unit Exponent (-3)
     0x65, 0x13,        //     Unit (System: English Linear, Length: Centimeter)
     0x35, 0x00,        //     Physical Minimum (0)
     0x46, 0xC0, 0x5D,  //     Physical Maximum (24000)
     0x15, 0x00,        //     Logical Minimum (0)
     0x26, 0xFF, 0x7F,  //     Logical Maximum (32767)
     0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
     0x09, 0x31,        //     Usage (Y)
     0x46, 0xB0, 0x36,  //     Physical Maximum (14000)
     0x81, 0x02,        //     Input (Data,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
     0x05, 0x0D,        //     Usage Page (Digitizer)
     0x09, 0x48,        //     Usage (0x48)
     0x36, 0xB8, 0x0B,  //     Physical Minimum (3000)
     0x46, 0xB8, 0x0B,  //     Physical Maximum (3000)
     0x16, 0xB8, 0x0B,  //     Logical Minimum (3000)
     0x26, 0xB8, 0x0B,  //     Logical Maximum (3000)
     0x81, 0x03,        //     Input (Const,Var,Abs,No Wrap,Linear,Preferred State,No Null Position)
     0xC0,              //   End Collection
     0xC0,              // End Collection
#endif
     // 101 bytes
//    0x06,0xFF,0xFF,             //135   GLOBAL_USAGE_PAGE(Reserved or Other)
//    0x09,0x01,                  //138   LOCAL_USAGE()
//    0xA1,0x01,                  //140   MAIN_COLLECTION(Applicatior)
//        0x85,HID_RPT_ID_OTHER,                  //142   GLOBAL_REPORT_ID(5)
//        0x09,0x01,                  //144   LOCAL_USAGE()
//        0x15,0x00,                  //146   GLOBAL_LOGICAL_MINIMUM(0)
//        0x26,0xFF,0x00,             //148   GLOBAL_LOCAL_MAXIMUM(255/255)
//        0x75,0x08,                  //151   GLOBAL_REPORT_SIZE(8)
//        0x95,0x03,                  //153   GLOBAL_REPORT_COUNT(3)
//        0x81,0x02,                  //155   MAIN_INPUT(data var absolute NoWrap linear PreferredState NoNullPosition NonVolatile )  Input 25.0
//    0xC0,                       //157   MAIN_COLLECTION_END
#endif
};

