sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
// HID report map length
uint16_t hidReportMapLen = sizeof(hidReportMap);

// HID report mapping table
static hidRptMap_t hidRptMap[HID_NUM_REPORTS];

/*********************************************************************
 * Profile Attributes - variables
 */

// HID Service attribute
static const gattAttrType_t hidService = {ATT_BT_UUID_SIZE, hidServUUID};

// Include attribute (Battery service)
static uint16_t include = GATT_INVALID_HANDLE;

// HID Information characteristic
static uint8_t hidInfoProps = GATT_PROP_READ;

// HID Report Map characteristic
static uint8_t hidReportMapProps = GATT_PROP_READ;

// HID External Report Reference Descriptor
static uint8_t hidExtReportRefDesc[ATT_BT_UUID_SIZE] =
    {LO_UINT16(BATT_LEVEL_UUID), HI_UINT16(BATT_LEVEL_UUID)};

// HID Control Point characteristic
static uint8_t hidControlPointProps = GATT_PROP_WRITE_NO_RSP;
static uint8_t hidControlPoint;

// HID Protocol Mode characteristic
static uint8_t hidProtocolModeProps = GATT_PROP_READ | GATT_PROP_WRITE_NO_RSP;
uint8_t        hidProtocolMode = HID_PROTOCOL_MODE_REPORT;

// HID Report characteristic, class key input
static uint8_t       hidReportClassKeyInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportClassKeyIn;
static gattCharCfg_t hidReportClassKeyInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, class key input
static uint8_t hidReportRefClassKeyIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_CLASS_KEY_IN, HID_REPORT_TYPE_INPUT};

// HID Report characteristic, LED output
static uint8_t hidReportLedOutProps = GATT_PROP_READ | GATT_PROP_WRITE | GATT_PROP_WRITE_NO_RSP;
static uint8_t hidReportLedOut;

// HID Report Reference characteristic descriptor, LED output
static uint8_t hidReportRefLedOut[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_LED_OUT, HID_REPORT_TYPE_OUTPUT};

#if TOUCH
//声明触摸板特征变量
// HID Report characteristic, Touchpad input
static uint8_t       hidReportTouchpadInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportTouchpadIn;
static gattCharCfg_t hidReportTouchpadInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, Touchpad input
static uint8_t hidReportTouchpadRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_TOUCHPAD_IN, HID_REPORT_TYPE_INPUT};


// 增加一个触控板FEATURE，用于报告表面触点，需要实现GATT 读写模式
// HID Report characteristic, Touchpad Feature
static uint8_t       hidReportTouchpadFeatureProps = GATT_PROP_READ | GATT_PROP_WRITE;
static uint8_t      hidReportTouchpadFeature[2];

static uint8_t       hidReportTouchpadFeatureRef[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_TOUCHPAD_FEATURE, HID_REPORT_TYPE_FEATURE};

#endif

#if MOUSE
// HID Report characteristic, Mouse input
static uint8_t       hidReportMouseInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportMouseIn;
static gattCharCfg_t hidReportMouseInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, Mouse input
static uint8_t hidReportRefMouseIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_MOUSE_IN, HID_REPORT_TYPE_INPUT};
#endif

// HID Report characteristic, consumer input
static uint8_t       hidReportConsumerInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportConsumerIn;
static gattCharCfg_t hidReportConsumerInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, consumer input
static uint8_t hidReportRefConsumerIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_CONSUMER_IN, HID_REPORT_TYPE_INPUT};

#if USE_SYS_CTR_HID

// HID Report characteristic, sys_ctl input
static uint8_t       hidReportSysCtlInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportSysCtlIn;
static gattCharCfg_t hidReportSysCtlInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, sys_ctl input
static uint8_t hidReportSysCtlRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_SYS_CTL_IN, HID_REPORT_TYPE_INPUT};
#endif

// HID Report characteristic, ALL_KEY input
static uint8_t       hidReportAllKeyInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportAllKeyIn;
static gattCharCfg_t hidReportAllKeyInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, ALL_KEY input
static uint8_t hidReportAllKeyRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_ALL_KEY_IN, HID_REPORT_TYPE_INPUT};

// HID Report characteristic, Fn input
static uint8_t       hidReportFnInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportFnIn;
static gattCharCfg_t hidReportFnInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, Fn input
static uint8_t hidReportFnRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_FN_IN, HID_REPORT_TYPE_INPUT};

// HID Report characteristic, SmartWheel input
static uint8_t       hidReportSmartWheelInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportSmartWheelIn;
static gattCharCfg_t hidReportSmartWheelInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Report Reference characteristic descriptor, SmartWheel input
static uint8_t hidReportSmartWheelRefIn[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_SMART_WHEEL_IN, HID_REPORT_TYPE_INPUT};

// HID Boot Keyboard Input Report
static uint8_t       hidReportBootKeyInProps = GATT_PROP_READ | GATT_PROP_NOTIFY;
static uint8_t       hidReportBootKeyIn;
static gattCharCfg_t hidReportBootKeyInClientCharCfg[GATT_MAX_NUM_CONN];

// HID Boot Keyboard Output Report
static uint8_t hidReportBootKeyOutProps = GATT_PROP_READ | GATT_PROP_WRITE | GATT_PROP_WRITE_NO_RSP;
static uint8_t hidReportBootKeyOut;

// Feature Report
static uint8_t hidReportFeatureProps = GATT_PROP_READ | GATT_PROP_WRITE;
static uint8_t hidReportFeature;

// HID Report Reference characteristic descriptor, Feature
static uint8_t hidReportRefFeature[HID_REPORT_REF_LEN] =
    {HID_RPT_ID_FEATURE, HID_REPORT_TYPE_FEATURE};

/*********************************************************************
 * Profile Attributes - Table
 */

static gattAttribute_t hidAttrTbl[] = {
    // HID Service
    {
        {ATT_BT_UUID_SIZE, primaryServiceUUID}, /* type */
        GATT_PERMIT_READ,                       /* permissions */
        0,                                      /* handle */
        (uint8_t *)&hidService                  /* pValue */
    },

    // Included service (battery)
    {
        {ATT_BT_UUID_SIZE, includeUUID},
        GATT_PERMIT_READ,
        0,
        (uint8_t *)&include},

    // HID Information characteristic declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidInfoProps},

    // HID Information characteristic
    {
        {ATT_BT_UUID_SIZE, hidInfoUUID},
        GATT_PERMIT_ENCRYPT_READ,
        0,
        (uint8_t *)hidInfo},

    // HID Control Point characteristic declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidControlPointProps},

    // HID Control Point characteristic
    {
        {ATT_BT_UUID_SIZE, hidControlPointUUID},
        GATT_PERMIT_ENCRYPT_WRITE,
        0,
        &hidControlPoint},

    // HID Protocol Mode characteristic declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidProtocolModeProps},

