sleepinghank/keyboard-framework/project/ch584m/Profile/hidkbdservice.c
        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportAllKeyInClientCharCfg},

        // HID Report Reference characteristic descriptor, ALL_KEY input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportAllKeyRefIn},

    // HID Report characteristic, Fn input declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportFnInProps},

        // HID Report characteristic, Fn input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportFnIn},

        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportFnInClientCharCfg},

        // HID Report Reference characteristic descriptor, Fn input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportFnRefIn},

    // HID Report characteristic, SmartWheel input declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportSmartWheelInProps},

        // HID Report characteristic, SmartWheel input
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportSmartWheelIn},

        // HID Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportSmartWheelInClientCharCfg},

        // HID Report Reference characteristic descriptor, SmartWheel input
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportSmartWheelRefIn},

    // HID Boot Keyboard Input Report declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportBootKeyInProps},

        // HID Boot Keyboard Input Report
        {
            {ATT_BT_UUID_SIZE, hidBootKeyInputUUID},
            GATT_PERMIT_ENCRYPT_READ,
            0,
            &hidReportBootKeyIn},

        // HID Boot Keyboard Input Report characteristic client characteristic configuration
        {
            {ATT_BT_UUID_SIZE, clientCharCfgUUID},
            GATT_PERMIT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            (uint8_t *)&hidReportBootKeyInClientCharCfg},

    // HID Boot Keyboard Output Report declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportBootKeyOutProps},

        // HID Boot Keyboard Output Report
        {
            {ATT_BT_UUID_SIZE, hidBootKeyOutputUUID},
            GATT_PERMIT_ENCRYPT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            &hidReportBootKeyOut},

    // Feature Report declaration
    {
        {ATT_BT_UUID_SIZE, characterUUID},
        GATT_PERMIT_READ,
        0,
        &hidReportFeatureProps},

        // Feature Report
        {
            {ATT_BT_UUID_SIZE, hidReportUUID},
            GATT_PERMIT_ENCRYPT_READ | GATT_PERMIT_ENCRYPT_WRITE,
            0,
            &hidReportFeature},

        // HID Report Reference characteristic descriptor, feature
        {
            {ATT_BT_UUID_SIZE, reportRefUUID},
            GATT_PERMIT_READ,
            0,
            hidReportRefFeature},
};

// Attribute index enumeration-- these indexes match array elements above
enum
{
    HID_SERVICE_IDX,             // HID Service
    HID_INCLUDED_SERVICE_IDX,    // Included Service
    HID_INFO_DECL_IDX,           // HID Information characteristic declaration
    HID_INFO_IDX,                // HID Information characteristic
    HID_CONTROL_POINT_DECL_IDX,  // HID Control Point characteristic declaration
    HID_CONTROL_POINT_IDX,       // HID Control Point characteristic
    HID_PROTOCOL_MODE_DECL_IDX,  // HID Protocol Mode characteristic declaration
    HID_PROTOCOL_MODE_IDX,       // HID Protocol Mode characteristic
    HID_REPORT_MAP_DECL_IDX,     // HID Report Map characteristic declaration
    HID_REPORT_MAP_IDX,          // HID Report Map characteristic
    HID_EXT_REPORT_REF_DESC_IDX, // HID External Report Reference Descriptor

#if USE_SYS_CTR_HID
    HID_REPORT_SYS_CTL_IN_DECL_IDX,  // HID Report characteristic, SYS_CTL input declaration
    HID_REPORT_SYS_CTL_IN_IDX,       // HID Report characteristic, SYS_CTL input
    HID_REPORT_SYS_CTL_IN_CCCD_IDX,  // HID Report characteristic client characteristic configuration
    HID_REPORT_REF_SYS_CTL_IN_IDX,   // HID Report Reference characteristic descriptor, SYS_CTL input
#endif

    HID_REPORT_CLASS_KEY_IN_DECL_IDX,  // HID Report characteristic, CLASS key input declaration
    HID_REPORT_CLASS_KEY_IN_IDX,       // HID Report characteristic, CLASS key input
    HID_REPORT_CLASS_KEY_IN_CCCD_IDX,  // HID Report characteristic client characteristic configuration
    HID_REPORT_CLASS_REF_KEY_IN_IDX,   // HID Report Reference characteristic descriptor, CLASS key input

    HID_REPORT_LED_OUT_DECL_IDX, // HID Report characteristic, LED output declaration
    HID_REPORT_LED_OUT_IDX,      // HID Report characteristic, LED output
    HID_REPORT_REF_LED_OUT_IDX,  // HID Report Reference characteristic descriptor, LED output

#if TOUCH
    HID_REPORT_TOUCHPAD_IN_DECL_IDX,  // HID Report characteristic, Touchpad input declaration  更新索引用于查表
    HID_REPORT_TOUCHPAD_IN_IDX,       // HID Report characteristic, Touchpad input
    HID_REPORT_TOUCHPAD_IN_CCCD_IDX,  // HID Report characteristic client characteristic configuration
    HID_REPORT_REF_TOUCHPAD_IN_IDX,   // HID Report Reference characteristic descriptor, Touchpad input

